app/controllers/avatars_controller.rb

  def create
    puts'ù'*300
    puts params[:featured_image]
    @users =User.find(current_user.id)
    @users.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2020-11-04 15:10:10.147257"], ["id", 1]]