app/controllers/chambres_controller.rb

    def index
        user = User.find(current_user.id)
        logement = user.logements
        indexa=[]
        chambres=[]
        lits=[]
                logement.each do |index|
---
SELECT "logements".* FROM "logements" WHERE "logements"."user_id" = $1  [["user_id", 1]]