app/controllers/chambres_controller.rb

    def index
        user = User.find(current_user.id)
        logement = Logement.find_by(id:params[:logement_id])
        chambres = logement.chambres
        salons = logement.salons
        autres = logement.autres

        chambre = Chambre.find_by(logement_id: params[:logement_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "chambres".* FROM "chambres" WHERE "chambres"."logement_id" = $1  [["logement_id", 1]]