app/controllers/logements_controller.rb

    def index
        user = User.find(current_user.id)
        logement = user.logements
        indexa=[]
        adresses=[]
                logement.each do |index|
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "logements".* FROM "logements" WHERE "logements"."user_id" = $1  [["user_id", 1]]

    def create
          puts '^^'*200
        logement= params[:hebergement]
        logement= JSON.parse(logement)
        @logement = Logement.new(name:logement["name"],types:logement["types"],categorie:logement["categorie"])
        @logement.user_id = current_user.id
        @logement.save


        @chambre = Chambre.create(title:"Chambre",logement_id: @logement.id)
        @salon = Salon.create(title: "Salon",logement_id: @logement.id)
        @autre = Autre.create(title: "Autre espace",logement_id: @logement.id)

        adresse= params[:localisation]
        adresse= JSON.parse(adresse)
        @adresse = Adresse.new(pays:adresse["pays"],ville:adresse["ville"],adresse:adresse["adresse"],code:adresse["code"])
        @adresse.logement_id = @logement.id
        @adresse.save



        #map controller new
        mape= params[:map]
        mape= JSON.parse(mape)
        @map = Map.new(longitude:mape["longitude"],latitude:mape["latitude"])
        @map.logement_id = @logement.id
        @map.save
---
INSERT INTO "logements" ("name", "categorie", "types", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "rolland"], ["categorie", "Chambre privé"], ["types", "Appartement"], ["user_id", 1], ["created_at", "2020-11-04 15:11:24.236550"], ["updated_at", "2020-11-04 15:11:24.236550"]]
INSERT INTO "chambres" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Chambre"], ["logement_id", 1], ["created_at", "2020-11-04 15:11:24.275172"], ["updated_at", "2020-11-04 15:11:24.275172"]]
INSERT INTO "salons" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Salon"], ["logement_id", 1], ["created_at", "2020-11-04 15:11:24.301668"], ["updated_at", "2020-11-04 15:11:24.301668"]]
INSERT INTO "autres" ("title", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Autre espace"], ["logement_id", 1], ["created_at", "2020-11-04 15:11:24.329623"], ["updated_at", "2020-11-04 15:11:24.329623"]]
INSERT INTO "adresses" ("pays", "ville", "adresse", "code", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["pays", "La Réunion"], ["ville", "sds"], ["adresse", "sds"], ["code", "12"], ["logement_id", 1], ["created_at", "2020-11-04 15:11:24.363594"], ["updated_at", "2020-11-04 15:11:24.363594"]]
INSERT INTO "maps" ("latitude", "longitude", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["latitude", -21.056910332399955], ["longitude", 55.39731740218187], ["logement_id", 1], ["created_at", "2020-11-04 15:11:24.391825"], ["updated_at", "2020-11-04 15:11:24.391825"]]

        canapes.each do |canape|
            @lits = Canape.new(name:canape["name"],quantite:canape["quantite"],checked:canape["checked"])
            @lits.salon_id = @chambre.id
            @lits.save
---
INSERT INTO "canapes" ("name", "quantite", "checked", "salon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", " Canapés"], ["quantite", 0], ["checked", false], ["salon_id", 1], ["created_at", "2020-11-04 15:15:40.693407"], ["updated_at", "2020-11-04 15:15:40.693407"]]
INSERT INTO "lits" ("name", "quantite", "checked", "chambre_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Lit Double"], ["quantite", 0], ["checked", false], ["chambre_id", 1], ["created_at", "2020-11-04 15:15:40.534033"], ["updated_at", "2020-11-04 15:15:40.534033"]]

        autres.each do |autre|
            @lits = Autrelit.new(name:autre["name"],quantite:autre["quantite"],checked:autre["checked"])
            @lits.autre_id = @chambre.id
            @lits.save
---
INSERT INTO "autrelits" ("name", "quantite", "checked", "autre_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Lit Simple"], ["quantite", 0], ["checked", false], ["autre_id", 1], ["created_at", "2020-11-04 15:15:40.742020"], ["updated_at", "2020-11-04 15:15:40.742020"]]
INSERT INTO "lits" ("name", "quantite", "checked", "chambre_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Lit Double"], ["quantite", 0], ["checked", false], ["chambre_id", 1], ["created_at", "2020-11-04 15:15:40.534033"], ["updated_at", "2020-11-04 15:15:40.534033"]]

        regles= JSON.parse(regles)
         @regle = Regle.new(regle:regles["regle"],arrive1:regles["arrive1"],arrive2:regles["arrive2"],depart1:regles["depart1"],depart2:regles["depart2"])
         @regle.logement_id = @logement.id
         @regle.save
---
INSERT INTO "regles" ("regle", "arrive1", "arrive2", "depart1", "depart2", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

        dates= JSON.parse(dates)
        @cal = Calendrier.new(startDate:dates["startDate"],endDate:dates["endDate"])
        @cal.logement_id = @logement.id
        @cal.save
---
INSERT INTO "calendriers" ("startDate", "endDate", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["startDate", "2020-11-25 21:00:00"], ["endDate", "2020-12-22 21:00:00"], ["logement_id", 1], ["created_at", "2020-11-04 15:15:40.500118"], ["updated_at", "2020-11-04 15:15:40.500118"]]

        conditions= JSON.parse(conditions)
        @condition = Condition.new(conditions:conditions["conditions"])
        @condition.logement_id = @logement.id
        @condition.save
---
INSERT INTO "conditions" ("conditions", "logement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["conditions", ""], ["logement_id", 1], ["created_at", "2020-11-04 15:15:40.401719"], ["updated_at", "2020-11-04 15:15:40.401719"]]