app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        show= User.find_by(id:current_user.id)

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "r@gmail.com"], ["LIMIT", 1]]
---
    def login
        @user = User.find_by(email: params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Runaza"], ["updated_at", "2020-11-04 15:09:57.168693"], ["id", 1]]
---
    def update
        @users =User.find_by(id:current_user.id)
       @users.update(user_params)